In [5]:
import numpy as np
import pandas as pd

**Section 3: Selection & Indexing (21-30)**

**21. Select a single column: DataFrame se 'Name' column ko ek Series ke roop mein select
karein.**

In [6]:
data = {
    'Name': ['Amit', 'Priya', 'Raj', 'Sneha', 'Karan', 'Meera'],
    'Age': [23, 25, 21, 22, 24, 26],
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Pune', 'Jaipur']
}

In [7]:
df = pd.DataFrame(data)
name_series = df["Name"]
name_series

0     Amit
1    Priya
2      Raj
3    Sneha
4    Karan
5    Meera
Name: Name, dtype: object

In [8]:
(type(name_series))

pandas.core.series.Series

**22. Select multiple columns: DataFrame se 'Name' aur 'Age' columns ko ek naye DataFrame ke
roop mein select karein.**

In [9]:
df = pd.DataFrame(data)
cat = df[["Name","Age"]]
cat

    Name  Age
0   Amit   23
1  Priya   25
2    Raj   21
3  Sneha   22
4  Karan   24
5  Meera   26

**23. Select a row using loc: Label-based indexing ka use karke index 'row1' waali row ko select
karein.**

In [10]:
df = pd.DataFrame(data,index=['row1','row2','row3','row4','row5','row6'])

In [11]:
df.loc['row1']

Name     Amit
Age        23
City    Delhi
Name: row1, dtype: object

**24. Select rows using iloc: Integer-based indexing ka use karke doosri row (index 1) ko select
karein**

In [12]:
df.iloc[[1]]

       Name  Age    City
row2  Priya   25  Mumbai



**25. Select a range of rows: iloc ka use karke index 2 se index 5 tak ki rows ko select karein.**

In [13]:
df.iloc[[2,3,4,5]]

       Name  Age     City
row3    Raj   21  Kolkata
row4  Sneha   22  Chennai
row5  Karan   24     Pune
row6  Meera   26   Jaipur

**26. Select a single value: loc ka use karke ek specific row aur column ka value select karein
(e.g., row 'row2', column 'col1').**

In [14]:
df.loc[['row2'],['Name']]

       Name
row2  Priya

**27. Select a slice of data: loc ka use karke specific rows aur columns ka ek subset select karein.**

In [15]:
df.loc['row2':'row4', ['Name', 'City']]

       Name     City
row2  Priya   Mumbai
row3    Raj  Kolkata
row4  Sneha  Chennai

In [16]:
df.loc[['row1','row5'], ['Age', 'City']]

      Age   City
row1   23  Delhi
row5   24   Pune

**28. Select a single column's first 5 rows: 'Age' column ke pehle 5 values ko select karein**

In [17]:
df.loc['row1':'row5' , ['Age']]

      Age
row1   23
row2   25
row3   21
row4   22
row5   24

**29. Set a column as the index: 'Name' column ko DataFrame ka naya index banayein.**

In [18]:
N = df.groupby('Name' , sort=False)
N
for i , v in N:
    print(i)
    print(v)

Amit
      Name  Age   City
row1  Amit   23  Delhi
Priya
       Name  Age    City
row2  Priya   25  Mumbai
Raj
     Name  Age     City
row3  Raj   21  Kolkata
Sneha
       Name  Age     City
row4  Sneha   22  Chennai
Karan
       Name  Age  City
row5  Karan   24  Pune
Meera
       Name  Age    City
row6  Meera   26  Jaipur

In [19]:
df

       Name  Age     City
row1   Amit   23    Delhi
row2  Priya   25   Mumbai
row3    Raj   21  Kolkata
row4  Sneha   22  Chennai
row5  Karan   24     Pune
row6  Meera   26   Jaipur

In [20]:
df.set_index('Name')

       Age     City
Name
Amit    23    Delhi
Priya   25   Mumbai
Raj     21  Kolkata
Sneha   22  Chennai
Karan   24     Pune
Meera   26   Jaipur

**30. Reset the index: DataFrame ke index ko reset karke default integer index par wapas layein.**

In [21]:
df.reindex()

       Name  Age     City
row1   Amit   23    Delhi
row2  Priya   25   Mumbai
row3    Raj   21  Kolkata
row4  Sneha   22  Chennai
row5  Karan   24     Pune
row6  Meera   26   Jaipur

In [22]:
df.reset_index()

  index   Name  Age     City
0  row1   Amit   23    Delhi
1  row2  Priya   25   Mumbai
2  row3    Raj   21  Kolkata
3  row4  Sneha   22  Chennai
4  row5  Karan   24     Pune
5  row6  Meera   26   Jaipur

**Section 4: Basic Filtering (31-40)**

**31. Filter based on one condition: DataFrame ko filter karein jahan 'Age' 30 se zyada ho.**

In [23]:
data = {
    'Name': ['Amit', 'Priya', 'Raj', 'Sneha', 'Karan', 'Meera'],
    'Age': [23, 35, 21, 32, 24, 40],  
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Pune', 'Jaipur']
}
df = pd.DataFrame(data)

In [24]:
df[df['Age']>30]

    Name  Age     City
1  Priya   35   Mumbai
3  Sneha   32  Chennai
5  Meera   40   Jaipur

**32. Filter based on a string value: DataFrame se un sabhi rows ko select karein jahan 'City'
column ki value 'New York' ho.**

In [25]:
data = {
    'Name': ['Amit', 'Priya', 'Gayatri', 'Sneha', 'Karan', 'Meera'],
    'Age': [23, 35, 21, 32, 26, 40],  
    'City': ['New york', 'London', 'New york', 'Paris', 'London', 'Paris']
}
df = pd.DataFrame(data)

In [26]:
df[df ['City'] == 'New york' ]

      Name  Age      City
0     Amit   23  New york
2  Gayatri   21  New york

**33. Filter based on multiple conditions (AND): Un rows ko filter karein jahan 'Age' 25 se zyada
ho aur 'City' 'London' ho.**

In [27]:
df[(df['Age']>25) & (df['City']== 'London' )]

    Name  Age    City
1  Priya   35  London
4  Karan   26  London

**34. Filter based on multiple conditions (OR): Un rows ko filter karein jahan 'Age' 30 se kam ho
ya 'City' 'Paris' ho.**

In [28]:
df[(df['Age']<30) | (df['City'] == 'Paris' )]

      Name  Age      City
0     Amit   23  New york
2  Gayatri   21  New york
3    Sneha   32     Paris
4    Karan   26    London
5    Meera   40     Paris

**35. Filter using isin(): Un sabhi rows ko select karein jinki 'City' 'Tokyo', 'Moscow', ya 'Berlin' mein
se ek ho.**

In [29]:
data = {
    'Name': ['Amit', 'Priya', 'Raj', 'Sneha', 'Karan', 'Meera', 'Arjun', 'Sara'],
    'Age':  [23,    35,     21,    32,     24,     40,      29,      34],
    'City': ['Delhi','Mumbai','Tokyo','Moscow','Pune','Berlin','Chennai','Jaipur']
}

df = pd.DataFrame(data)

In [30]:
df

    Name  Age     City
0   Amit   23    Delhi
1  Priya   35   Mumbai
2    Raj   21    Tokyo
3  Sneha   32   Moscow
4  Karan   24     Pune
5  Meera   40   Berlin
6  Arjun   29  Chennai
7   Sara   34   Jaipur

In [31]:
df.isin(['Tokyo','Berlin','Moscow'])

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False   True
4  False  False  False
5  False  False   True
6  False  False  False
7  False  False  False

In [32]:
df[df['City'].isin(['Tokyo','Berlin','Moscow'])]

    Name  Age    City
2    Raj   21   Tokyo
3  Sneha   32  Moscow
5  Meera   40  Berlin

**36. Filter out values: Un sabhi rows ko select karein jinki 'City' 'New York' na ho.**

In [33]:
df[~df['City'].isin(['Tokyo','Berlin','Moscow'])]

    Name  Age     City
0   Amit   23    Delhi
1  Priya   35   Mumbai
4  Karan   24     Pune
6  Arjun   29  Chennai
7   Sara   34   Jaipur

**37. Filter for non-null values: Ek specific column se un sabhi rows ko select karein jahan value
null na ho.**

In [34]:
data = {
'A' : [1 , 2 , np.nan , 4 , 5],
'B' : [1 , 2 , 3 , 4 , 5],
'C' : [1 , 2 , 3 , np.nan , np.nan],
'D' : [1 , np.nan ,np.nan , np.nan , 5 ]
}
df = pd.DataFrame(data)

In [35]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [37]:
df1 = df[df['A'].notnull()]
df1

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

40. Filter using a query: query() method ka use karke 'Age > 22' condition ke saath rows ko filter
karein.

In [40]:
data = {
    'Name': ['Amit', 'Priya', 'Raj', 'Sneha', 'Karan', 'Meera'],
    'Age': [23, 25, 21, 22, 24, 26],
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Pune', 'Jaipur']
}
df = pd.DataFrame(data)

In [41]:
df

    Name  Age     City
0   Amit   23    Delhi
1  Priya   25   Mumbai
2    Raj   21  Kolkata
3  Sneha   22  Chennai
4  Karan   24     Pune
5  Meera   26   Jaipur

In [42]:
df.query('Age > 25')

    Name  Age    City
5  Meera   26  Jaipur